user_tutorial/fluidOptFoam/fluidOpt_bend_S/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          367506;
        startFace       366084;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2742;
        startFace       733590;
    }
    inlet
    {
        type            patch;
        nFaces          51;
        startFace       736332;
    }
    outlet
    {
        type            patch;
        nFaces          51;
        startFace       736383;
    }
)

// ************************************************************************* //
