user_tutorial/fluidOptFoam/fluidOpt_bend_S/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class       dictionary;
location    "constant";
object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
nu                         nu [0  2 -1 0 0 0 0] 29.1e-06;	// Viscosity

// Material densities
rho_fluid           rho_fluid [1 -3  0 0 0 0 0] 865.0;		// Fluid density
rho_solid           rho_solid [1 -3  0 0 0 0 0] 2780.0;		// Solid density

//// Porosity controls
// Flow resistance (rapidly slows fluid velocity as pseudo density transitions to 0 -> solid)
alpha_U_max       alpha_U_max [0  0 -1 0 0 0 0] 1.0e05;		// Flow resistance max reference
alpha_U_limit   alpha_U_limit [0  0 -1 0 0 0 0] 1.0e07;		// Flow resistance limit
dalpha		                                    0.0;		// Percent increase rate for flow resistance

// RAMP function constant (increases transition rate between fluid and solid)
q_factor                                        1.0e-04;	// Shape factor used to scale ramp function
q_factor_limit                                  0.01;		// Shape factor limit
dq_factor                                       10.0;		// Percent increase rate for shape factor (near convergence)
n_rapid                                         10.0;		// Factor that controls when to increase q_factor based on proximity to convergence
