user_tutorial/fluidOptFoam/fluidOpt_bend_S/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

// the updated blockMesh (openfoam.com) fails on some meshes with default options;
// it reports report inconsistent number of faces although the mesh is still OK.
// this happens where two 'wedge' blocks with different numbers of cells join in the same
// point/edge.
mergeType points;
checkFaceCorrespondence false;



vertices
(
    
    (0.00000000 0.00000000 -0.10000000) // 0
    (5.00000000 0.00000000 -0.10000000) // 1
    (5.00000000 5.00000000 -0.10000000) // 2
    (0.00000000 5.00000000 -0.10000000) // 3
    (0.00000000 0.00000000 0.00000000) // 4
    (5.00000000 0.00000000 0.00000000) // 5
    (5.00000000 5.00000000 0.00000000) // 6
    (0.00000000 5.00000000 0.00000000) // 7
    (5.00000000 -5.00000000 -0.10000000) // 8
    (25.00000000 -5.00000000 -0.10000000) // 9
    (25.00000000 0.00000000 -0.10000000) // 10
    (5.00000000 -5.00000000 0.00000000) // 11
    (25.00000000 -5.00000000 0.00000000) // 12
    (25.00000000 0.00000000 0.00000000) // 13
    (30.00000000 -5.00000000 -0.10000000) // 14
    (30.00000000 0.00000000 -0.10000000) // 15
    (30.00000000 -5.00000000 0.00000000) // 16
    (30.00000000 0.00000000 0.00000000) // 17
    (35.00000000 -5.00000000 -0.10000000) // 18
    (35.00000000 0.00000000 -0.10000000) // 19
    (35.00000000 -5.00000000 0.00000000) // 20
    (35.00000000 0.00000000 0.00000000) // 21
    (40.00000000 -5.00000000 -0.10000000) // 22
    (40.00000000 0.00000000 -0.10000000) // 23
    (40.00000000 -5.00000000 0.00000000) // 24
    (40.00000000 0.00000000 0.00000000) // 25
    (25.00000000 5.00000000 -0.10000000) // 26
    (25.00000000 5.00000000 0.00000000) // 27
    (30.00000000 5.00000000 -0.10000000) // 28
    (30.00000000 5.00000000 0.00000000) // 29
    (35.00000000 5.00000000 -0.10000000) // 30
    (35.00000000 5.00000000 0.00000000) // 31
    (40.00000000 5.00000000 -0.10000000) // 32
    (40.00000000 5.00000000 0.00000000) // 33
    (25.00000000 10.00000000 -0.10000000) // 34
    (5.00000000 10.00000000 -0.10000000) // 35
    (25.00000000 10.00000000 0.00000000) // 36
    (5.00000000 10.00000000 0.00000000) // 37
    (30.00000000 10.00000000 -0.10000000) // 38
    (30.00000000 10.00000000 0.00000000) // 39
    (35.00000000 10.00000000 -0.10000000) // 40
    (35.00000000 10.00000000 0.00000000) // 41
    (40.00000000 10.00000000 -0.10000000) // 42
    (40.00000000 10.00000000 0.00000000) // 43
    (30.00000000 15.00000000 -0.10000000) // 44
    (25.00000000 15.00000000 -0.10000000) // 45
    (30.00000000 15.00000000 0.00000000) // 46
    (25.00000000 15.00000000 0.00000000) // 47
    (35.00000000 15.00000000 -0.10000000) // 48
    (35.00000000 15.00000000 0.00000000) // 49
    (40.00000000 15.00000000 -0.10000000) // 50
    (40.00000000 15.00000000 0.00000000) // 51
    (5.00000000 15.00000000 -0.10000000) // 52
    (10.00000000 15.00000000 -0.10000000) // 53
    (10.00000000 20.00000000 -0.10000000) // 54
    (5.00000000 20.00000000 -0.10000000) // 55
    (5.00000000 15.00000000 0.00000000) // 56
    (10.00000000 15.00000000 0.00000000) // 57
    (10.00000000 20.00000000 0.00000000) // 58
    (5.00000000 20.00000000 0.00000000) // 59
    (15.00000000 15.00000000 -0.10000000) // 60
    (15.00000000 20.00000000 -0.10000000) // 61
    (15.00000000 15.00000000 0.00000000) // 62
    (15.00000000 20.00000000 0.00000000) // 63
    (20.00000000 15.00000000 -0.10000000) // 64
    (20.00000000 20.00000000 -0.10000000) // 65
    (20.00000000 15.00000000 0.00000000) // 66
    (20.00000000 20.00000000 0.00000000) // 67
    (25.00000000 20.00000000 -0.10000000) // 68
    (25.00000000 20.00000000 0.00000000) // 69
    (30.00000000 20.00000000 -0.10000000) // 70
    (30.00000000 20.00000000 0.00000000) // 71
    (35.00000000 20.00000000 -0.10000000) // 72
    (35.00000000 20.00000000 0.00000000) // 73
    (40.00000000 20.00000000 -0.10000000) // 74
    (40.00000000 20.00000000 0.00000000) // 75
    (10.00000000 25.00000000 -0.10000000) // 76
    (5.00000000 25.00000000 -0.10000000) // 77
    (10.00000000 25.00000000 0.00000000) // 78
    (5.00000000 25.00000000 0.00000000) // 79
    (15.00000000 25.00000000 -0.10000000) // 80
    (15.00000000 25.00000000 0.00000000) // 81
    (20.00000000 25.00000000 -0.10000000) // 82
    (20.00000000 25.00000000 0.00000000) // 83
    (25.00000000 25.00000000 -0.10000000) // 84
    (25.00000000 25.00000000 0.00000000) // 85
    (30.00000000 25.00000000 -0.10000000) // 86
    (30.00000000 25.00000000 0.00000000) // 87
    (35.00000000 25.00000000 -0.10000000) // 88
    (35.00000000 25.00000000 0.00000000) // 89
    (40.00000000 25.00000000 -0.10000000) // 90
    (40.00000000 25.00000000 0.00000000) // 91
    (10.00000000 30.00000000 -0.10000000) // 92
    (5.00000000 30.00000000 -0.10000000) // 93
    (10.00000000 30.00000000 0.00000000) // 94
    (5.00000000 30.00000000 0.00000000) // 95
    (15.00000000 30.00000000 -0.10000000) // 96
    (15.00000000 30.00000000 0.00000000) // 97
    (20.00000000 30.00000000 -0.10000000) // 98
    (20.00000000 30.00000000 0.00000000) // 99
    (25.00000000 30.00000000 -0.10000000) // 100
    (25.00000000 30.00000000 0.00000000) // 101
    (30.00000000 30.00000000 -0.10000000) // 102
    (30.00000000 30.00000000 0.00000000) // 103
    (35.00000000 30.00000000 -0.10000000) // 104
    (35.00000000 30.00000000 0.00000000) // 105
    (40.00000000 30.00000000 -0.10000000) // 106
    (40.00000000 30.00000000 0.00000000) // 107
    (10.00000000 35.00000000 -0.10000000) // 108
    (5.00000000 35.00000000 -0.10000000) // 109
    (10.00000000 35.00000000 0.00000000) // 110
    (5.00000000 35.00000000 0.00000000) // 111
    (15.00000000 35.00000000 -0.10000000) // 112
    (15.00000000 35.00000000 0.00000000) // 113
    (20.00000000 35.00000000 -0.10000000) // 114
    (20.00000000 35.00000000 0.00000000) // 115
    (10.00000000 40.00000000 -0.10000000) // 116
    (5.00000000 40.00000000 -0.10000000) // 117
    (10.00000000 40.00000000 0.00000000) // 118
    (5.00000000 40.00000000 0.00000000) // 119
    (15.00000000 40.00000000 -0.10000000) // 120
    (15.00000000 40.00000000 0.00000000) // 121
    (20.00000000 40.00000000 -0.10000000) // 122
    (20.00000000 40.00000000 0.00000000) // 123
    (40.00000000 35.00000000 -0.10000000) // 124
    (40.00000000 40.00000000 -0.10000000) // 125
    (40.00000000 35.00000000 0.00000000) // 126
    (40.00000000 40.00000000 0.00000000) // 127
    (10.00000000 45.00000000 -0.10000000) // 128
    (5.00000000 45.00000000 -0.10000000) // 129
    (10.00000000 45.00000000 0.00000000) // 130
    (5.00000000 45.00000000 0.00000000) // 131
    (15.00000000 45.00000000 -0.10000000) // 132
    (15.00000000 45.00000000 0.00000000) // 133
    (20.00000000 45.00000000 -0.10000000) // 134
    (20.00000000 45.00000000 0.00000000) // 135
    (40.00000000 45.00000000 -0.10000000) // 136
    (40.00000000 45.00000000 0.00000000) // 137
    (10.00000000 50.00000000 -0.10000000) // 138
    (5.00000000 50.00000000 -0.10000000) // 139
    (10.00000000 50.00000000 0.00000000) // 140
    (5.00000000 50.00000000 0.00000000) // 141
    (15.00000000 50.00000000 -0.10000000) // 142
    (15.00000000 50.00000000 0.00000000) // 143
    (20.00000000 50.00000000 -0.10000000) // 144
    (20.00000000 50.00000000 0.00000000) // 145
    (40.00000000 50.00000000 -0.10000000) // 146
    (40.00000000 50.00000000 0.00000000) // 147
    (45.00000000 40.00000000 -0.10000000) // 148
    (45.00000000 45.00000000 -0.10000000) // 149
    (45.00000000 40.00000000 0.00000000) // 150
    (45.00000000 45.00000000 0.00000000) // 151
);

blocks
(
    
    hex ( 0 1 2 3 4 5 6 7 )
    zone_fluid (51 51 1)  simpleGrading (1 1 1) // 0

    hex ( 8 9 10 1 11 12 13 5 )  (201 51 1)  simpleGrading (1 1 1) // 1
    hex ( 9 14 15 10 12 16 17 13 )  (51 51 1)  simpleGrading (1 1 1) // 2
    hex ( 14 18 19 15 16 20 21 17 )  (51 51 1)  simpleGrading (1 1 1) // 3
    hex ( 18 22 23 19 20 24 25 21 )  (51 51 1)  simpleGrading (1 1 1) // 4

    hex ( 1 10 26 2 5 13 27 6 )
    zone_test (201 51 1)  simpleGrading (1 1 1) // 5

    hex ( 10 15 28 26 13 17 29 27 )
    zone_test (51 51 1)  simpleGrading (1 1 1) // 6

    hex ( 15 19 30 28 17 21 31 29 )
    zone_test (51 51 1)  simpleGrading (1 1 1) // 7

    hex ( 19 23 32 30 21 25 33 31 )  (51 51 1)  simpleGrading (1 1 1) // 8
    hex ( 2 26 34 35 6 27 36 37 )  (201 51 1)  simpleGrading (1 1 1) // 9
    hex ( 26 28 38 34 27 29 39 36 )  (51 51 1)  simpleGrading (1 1 1) // 10

    hex ( 28 30 40 38 29 31 41 39 )
    zone_test (51 51 1)  simpleGrading (1 1 1) // 11

    hex ( 30 32 42 40 31 33 43 41 )  (51 51 1)  simpleGrading (1 1 1) // 12
    hex ( 34 38 44 45 36 39 46 47 )  (51 51 1)  simpleGrading (1 1 1) // 13

    hex ( 38 40 48 44 39 41 49 46 )
    zone_test (51 51 1)  simpleGrading (1 1 1) // 14

    hex ( 40 42 50 48 41 43 51 49 )  (51 51 1)  simpleGrading (1 1 1) // 15
    hex ( 52 53 54 55 56 57 58 59 )  (51 51 1)  simpleGrading (1 1 1) // 16
    hex ( 53 60 61 54 57 62 63 58 )  (51 51 1)  simpleGrading (1 1 1) // 17
    hex ( 60 64 65 61 62 66 67 63 )  (51 51 1)  simpleGrading (1 1 1) // 18
    hex ( 64 45 68 65 66 47 69 67 )  (51 51 1)  simpleGrading (1 1 1) // 19
    hex ( 45 44 70 68 47 46 71 69 )  (51 51 1)  simpleGrading (1 1 1) // 20

    hex ( 44 48 72 70 46 49 73 71 )
    zone_test (51 51 1)  simpleGrading (1 1 1) // 21

    hex ( 48 50 74 72 49 51 75 73 )  (51 51 1)  simpleGrading (1 1 1) // 22
    hex ( 55 54 76 77 59 58 78 79 )  (51 51 1)  simpleGrading (1 1 1) // 23

    hex ( 54 61 80 76 58 63 81 78 )
    zone_test (51 51 1)  simpleGrading (1 1 1) // 24

    hex ( 61 65 82 80 63 67 83 81 )
    zone_test (51 51 1)  simpleGrading (1 1 1) // 25

    hex ( 65 68 84 82 67 69 85 83 )
    zone_test (51 51 1)  simpleGrading (1 1 1) // 26

    hex ( 68 70 86 84 69 71 87 85 )
    zone_test (51 51 1)  simpleGrading (1 1 1) // 27

    hex ( 70 72 88 86 71 73 89 87 )
    zone_test (51 51 1)  simpleGrading (1 1 1) // 28

    hex ( 72 74 90 88 73 75 91 89 )  (51 51 1)  simpleGrading (1 1 1) // 29
    hex ( 77 76 92 93 79 78 94 95 )  (51 51 1)  simpleGrading (1 1 1) // 30

    hex ( 76 80 96 92 78 81 97 94 )
    zone_test (51 51 1)  simpleGrading (1 1 1) // 31

    hex ( 80 82 98 96 81 83 99 97 )  (51 51 1)  simpleGrading (1 1 1) // 32
    hex ( 82 84 100 98 83 85 101 99 )  (51 51 1)  simpleGrading (1 1 1) // 33
    hex ( 84 86 102 100 85 87 103 101 )  (51 51 1)  simpleGrading (1 1 1) // 34
    hex ( 86 88 104 102 87 89 105 103 )  (51 51 1)  simpleGrading (1 1 1) // 35
    hex ( 88 90 106 104 89 91 107 105 )  (51 51 1)  simpleGrading (1 1 1) // 36
    hex ( 93 92 108 109 95 94 110 111 )  (51 51 1)  simpleGrading (1 1 1) // 37

    hex ( 92 96 112 108 94 97 113 110 )
    zone_test (51 51 1)  simpleGrading (1 1 1) // 38

    hex ( 96 98 114 112 97 99 115 113 )  (51 51 1)  simpleGrading (1 1 1) // 39
    hex ( 109 108 116 117 111 110 118 119 )  (51 51 1)  simpleGrading (1 1 1) // 40

    hex ( 108 112 120 116 110 113 121 118 )
    zone_test (51 51 1)  simpleGrading (1 1 1) // 41

    hex ( 112 114 122 120 113 115 123 121 )  (51 51 1)  simpleGrading (1 1 1) // 42
    hex ( 114 124 125 122 115 126 127 123 )  (201 51 1)  simpleGrading (1 1 1) // 43
    hex ( 117 116 128 129 119 118 130 131 )  (51 51 1)  simpleGrading (1 1 1) // 44

    hex ( 116 120 132 128 118 121 133 130 )
    zone_test (51 51 1)  simpleGrading (1 1 1) // 45

    hex ( 120 122 134 132 121 123 135 133 )
    zone_test (51 51 1)  simpleGrading (1 1 1) // 46

    hex ( 122 125 136 134 123 127 137 135 )
    zone_test (201 51 1)  simpleGrading (1 1 1) // 47

    hex ( 129 128 138 139 131 130 140 141 )  (51 51 1)  simpleGrading (1 1 1) // 48
    hex ( 128 132 142 138 130 133 143 140 )  (51 51 1)  simpleGrading (1 1 1) // 49
    hex ( 132 134 144 142 133 135 145 143 )  (51 51 1)  simpleGrading (1 1 1) // 50
    hex ( 134 136 146 144 135 137 147 145 )  (201 51 1)  simpleGrading (1 1 1) // 51

    hex ( 125 148 149 136 127 150 151 137 )
    zone_fluid (51 51 1)  simpleGrading (1 1 1) // 52
);

edges
(
    
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (0 1 2 3)
            (11 12 13 5)
            (8 9 10 1)
            (12 16 17 13)
            (9 14 15 10)
            (16 20 21 17)
            (14 18 19 15)
            (20 24 25 21)
            (18 22 23 19)
            (5 13 27 6)
            (1 10 26 2)
            (13 17 29 27)
            (10 15 28 26)
            (17 21 31 29)
            (15 19 30 28)
            (21 25 33 31)
            (19 23 32 30)
            (6 27 36 37)
            (2 26 34 35)
            (27 29 39 36)
            (26 28 38 34)
            (29 31 41 39)
            (28 30 40 38)
            (31 33 43 41)
            (30 32 42 40)
            (36 39 46 47)
            (34 38 44 45)
            (39 41 49 46)
            (38 40 48 44)
            (41 43 51 49)
            (40 42 50 48)
            (56 57 58 59)
            (52 53 54 55)
            (57 62 63 58)
            (53 60 61 54)
            (62 66 67 63)
            (60 64 65 61)
            (66 47 69 67)
            (64 45 68 65)
            (47 46 71 69)
            (45 44 70 68)
            (46 49 73 71)
            (44 48 72 70)
            (49 51 75 73)
            (48 50 74 72)
            (59 58 78 79)
            (55 54 76 77)
            (58 63 81 78)
            (54 61 80 76)
            (63 67 83 81)
            (61 65 82 80)
            (67 69 85 83)
            (65 68 84 82)
            (69 71 87 85)
            (68 70 86 84)
            (71 73 89 87)
            (70 72 88 86)
            (73 75 91 89)
            (72 74 90 88)
            (79 78 94 95)
            (77 76 92 93)
            (78 81 97 94)
            (76 80 96 92)
            (81 83 99 97)
            (80 82 98 96)
            (83 85 101 99)
            (82 84 100 98)
            (85 87 103 101)
            (84 86 102 100)
            (87 89 105 103)
            (86 88 104 102)
            (89 91 107 105)
            (88 90 106 104)
            (95 94 110 111)
            (93 92 108 109)
            (94 97 113 110)
            (92 96 112 108)
            (97 99 115 113)
            (96 98 114 112)
            (111 110 118 119)
            (109 108 116 117)
            (110 113 121 118)
            (108 112 120 116)
            (113 115 123 121)
            (112 114 122 120)
            (115 126 127 123)
            (114 124 125 122)
            (119 118 130 131)
            (117 116 128 129)
            (118 121 133 130)
            (116 120 132 128)
            (121 123 135 133)
            (120 122 134 132)
            (123 127 137 135)
            (122 125 136 134)
            (131 130 140 141)
            (129 128 138 139)
            (130 133 143 140)
            (128 132 142 138)
            (133 135 145 143)
            (132 134 144 142)
            (135 137 147 145)
            (134 136 146 144)
            (127 150 151 137)
            (125 148 149 136)
            
        );

    }

    walls
    {
        type wall;
        faces
        (
            (4 5 1 0)
            (7 6 2 3)
            (11 12 9 8)
            (11 8 1 5)
            (12 16 14 9)
            (16 20 18 14)
            (20 24 22 18)
            (24 22 23 25)
            (25 23 32 33)
            (37 36 34 35)
            (6 2 35 37)
            (33 32 42 43)
            (36 34 45 47)
            (43 42 50 51)
            (56 57 53 52)
            (56 52 55 59)
            (57 62 60 53)
            (62 66 64 60)
            (66 47 45 64)
            (51 50 74 75)
            (59 55 77 79)
            (75 74 90 91)
            (79 77 93 95)
            (99 101 100 98)
            (101 103 102 100)
            (103 105 104 102)
            (105 107 106 104)
            (91 90 106 107)
            (95 93 109 111)
            (99 98 114 115)
            (111 109 117 119)
            (115 126 124 114)
            (126 124 125 127)
            (119 117 129 131)
            (141 140 138 139)
            (131 129 139 141)
            (140 143 142 138)
            (143 145 144 142)
            (145 147 146 144)
            (137 136 146 147)
            (127 150 148 125)
            (137 151 149 136)
            
        );

    }

    inlet
    {
        type patch;
        faces
        (
            (4 0 3 7)
            
        );

    }

    outlet
    {
        type patch;
        faces
        (
            (150 148 149 151)
            
        );

    }
);

mergePatchPairs
();



faces
();


// ************************************************************************* //
